{"sections":{"slideshow-00":{"type":"image--slideshow","blocks":{"164813303069db6705-0":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/STORY_-_BANNER.png","title":"FOUNDER'S STORY","text":"","button_label":"","button_link":"","caption-background":"rgba(0,0,0,0)","caption-text":"#ffffff","button-text":"#ffffff","button-background":"#000000","captionHorizontal":"right","captionAlignment":"center"}}},"block_order":["164813303069db6705-0"],"settings":{"slider-animation":"slide","slider-width":"full-width","vertical-alignment":false,"text-below-image":false,"slider-slide-time":5,"caption-heading-size":32,"caption-subheading-size":16,"caption-button-size":16,"show-slide-dots":false,"show-slide-arrows":true,"slider-navigation-color":"#ffffff"}},"main":{"type":"template--page","disabled":true,"settings":{"page_width":"full-width"}},"1657914129399cb46c":{"type":"text--rich-text","settings":{"colors":"white","title":"MY NAME IS FLORA","text":"<p>I was born in Seoul, South Korea, in a culture full of innovation and drive.  My childhood was both idyllic and complicated as we moved across continents to Europe first, then North America.  Growing up in Paris, I was immersed and mesmerized by a world of beauty, and it was in France where my name “Flora” came to be.  Then the transition to New York, coinciding with the dissolution of my parent’s marriage, brought me to a city filled with immigrant dreams, and taught me the meaning of grit.<\/p><p>After finishing undergrad at Harvard, I was working to support my mom as an investment bank analyst in Manhattan when 9\/11 happened.  In the blink of an eye, I understood that everything can be unexpectedly taken away.  I was challenged and haunted by the question of how I could make my one life count.  So I left Wall Street to manifest a deeper calling within.  <\/p><p>It is this voice inside that guides my life, reminding me to be the creator of my own experience.  Along the way, there has been both encouragement and voices of utter dismissal, asserting “That will never happen.”  I tell my kids to feel the feeling of the wish fulfilled because that is what I tell myself.  <\/p><p>As a Korean woman, I am expected to be humble over ambitious - but I always had hidden dreams.  I am a dermatologist and skin is the vehicle through which I have found my purpose.  Every day, I see more and more skin cancers and worsening environmental impact on our delicate skin.  I had an idea to create an outer invisible protective layer for our skin to be a shield from the harmful effects of the sun and the consequences of our modern lifestyle.  This is the 8th LAYER, the culmination of a wish fulfilled.  It is science and technology that can change how we co-exist with the world around us, but it is also affirmation that, maybe, just maybe, I can make a difference.  <\/p><p>I am forever grateful to all those who have believed in me, inspired me, and supported me in this journey.  <br\/><br\/>This is my labor of love, from my heart to yours…<\/p><p> - FLORA KIM MD, FAAD<br\/>8th LAYER Creator & Founder<\/p><p><\/p><p><\/p>","button_label":"SHOP 8TH LAYER","button_link":"shopify:\/\/collections\/all"}}},"order":["slideshow-00","main","1657914129399cb46c"]}